from enum import Enum

class nomenclature_type(Enum):
    """
    Доменная модель (Value Object): Тип номенклатуры.
    Используется для строгой типизации системы, чтобы алгоритмы (например, расчет веса)
    могли программно отличать съедобное сырье от заготовок и тары
    """

    # Базовое сырье или финальное готовое блюдо
    PRODUCT = "Продукт"

    # Внутренняя заготовка (рецепт внутри рецепта), которая сама состоит из ингредиентов
    SEMI_FINISHED = "Полуфабрикат"

    # Несъедобная тара (контейнер)
    PACKAGING = "Упаковка"